MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GP506/mcu.h
#define _C1RXFUL1_RXFUL12_POSITION               0x0000000C
#define _C1RXFUL1_RXFUL12_MASK                   0x00001000
#define _C1RXFUL1_RXFUL12_LENGTH                 0x00000001

#define _C1RXFUL1_RXFUL13_POSITION               0x0000000D
#define _C1RXFUL1_RXFUL13_MASK                   0x00002000
#define _C1RXFUL1_RXFUL13_LENGTH                 0x00000001

#define _C1RXFUL1_RXFUL14_POSITION               0x0000000E
#define _C1RXFUL1_RXFUL14_MASK                   0x00004000
#define _C1RXFUL1_RXFUL14_LENGTH                 0x00000001

#define _C1RXFUL1_RXFUL15_POSITION               0x0000000F
#define _C1RXFUL1_RXFUL15_MASK                   0x00008000
#define _C1RXFUL1_RXFUL15_LENGTH                 0x00000001

#define _C1BUFPNT2_F4BP_POSITION                 0x00000000
#define _C1BUFPNT2_F4BP_MASK                     0x0000000F
#define _C1BUFPNT2_F4BP_LENGTH                   0x00000004

#define _C1BUFPNT2_F5BP_POSITION                 0x00000004
#define _C1BUFPNT2_F5BP_MASK                     0x000000F0
#define _C1BUFPNT2_F5BP_LENGTH                   0x00000004

#define _C1BUFPNT2_F6BP_POSITION                 0x00000008
#define _C1BUFPNT2_F6BP_MASK                     0x00000F00
#define _C1BUFPNT2_F6BP_LENGTH                   0x00000004

#define _C1BUFPNT2_F7BP_POSITION                 0x0000000C
#define _C1BUFPNT2_F7BP_MASK                     0x0000F000
#define _C1BUFPNT2_F7BP_LENGTH                   0x00000004

#define _C1BUFPNT2_F4BP0_POSITION                0x00000000
#define _C1BUFPNT2_F4BP0_MASK                    0x00000001
#define _C1BUFPNT2_F4BP0_LENGTH                  0x00000001

#define _C1BUFPNT2_F4BP1_POSITION                0x00000001
#define _C1BUFPNT2_F4BP1_MASK                    0x00000002
#define _C1BUFPNT2_F4BP1_LENGTH                  0x00000001

#define _C1BUFPNT2_F4BP2_POSITION                0x00000002
#define _C1BUFPNT2_F4BP2_MASK                    0x00000004
#define _C1BUFPNT2_F4BP2_LENGTH                  0x00000001

#define _C1BUFPNT2_F4BP3_POSITION                0x00000003
#define _C1BUFPNT2_F4BP3_MASK                    0x00000008
#define _C1BUFPNT2_F4BP3_LENGTH                  0x00000001

#define _C1BUFPNT2_F5BP0_POSITION                0x00000004
#define _C1BUFPNT2_F5BP0_MASK                    0x00000010
#define _C1BUFPNT2_F5BP0_LENGTH                  0x00000001

#define _C1BUFPNT2_F5BP1_POSITION                0x00000005
#define _C1BUFPNT2_F5BP1_MASK                    0x00000020
#define _C1BUFPNT2_F5BP1_LENGTH                  0x00000001

#define _C1BUFPNT2_F5BP2_POSITION                0x00000006
#define _C1BUFPNT2_F5BP2_MASK                    0x00000040
#define _C1BUFPNT2_F5BP2_LENGTH                  0x00000001

#define _C1BUFPNT2_F5BP3_POSITION                0x00000007
#define _C1BUFPNT2_F5BP3_MASK                    0x00000080
#define _C1BUFPNT2_F5BP3_LENGTH                  0x00000001

#define _C1BUFPNT2_F6BP0_POSITION                0x00000008
#define _C1BUFPNT2_F6BP0_MASK                    0x00000100
#define _C1BUFPNT2_F6BP0_LENGTH                  0x00000001

#define _C1BUFPNT2_F6BP1_POSITION                0x00000009
#define _C1BUFPNT2_F6BP1_MASK                    0x00000200
#define _C1BUFPNT2_F6BP1_LENGTH                  0x00000001

#define _C1BUFPNT2_F6BP2_POSITION                0x0000000A
#define _C1BUFPNT2_F6BP2_MASK                    0x00000400
#define _C1BUFPNT2_F6BP2_LENGTH                  0x00000001

#define _C1BUFPNT2_F6BP3_POSITION                0x0000000B
#define _C1BUFPNT2_F6BP3_MASK                    0x00000800
#define _C1BUFPNT2_F6BP3_LENGTH                  0x00000001

#define _C1BUFPNT2_F7BP0_POSITION                0x0000000C
#define _C1BUFPNT2_F7BP0_MASK                    0x00001000
#define _C1BUFPNT2_F7BP0_LENGTH                  0x00000001

#define _C1BUFPNT2_F7BP1_POSITION                0x0000000D
#define _C1BUFPNT2_F7BP1_MASK                    0x00002000
#define _C1BUFPNT2_F7BP1_LENGTH                  0x00000001

#define _C1BUFPNT2_F7BP2_POSITION                0x0000000E
#define _C1BUFPNT2_F7BP2_MASK                    0x00004000
#define _C1BUFPNT2_F7BP2_LENGTH                  0x00000001

#define _C1BUFPNT2_F7BP3_POSITION                0x0000000F
#define _C1BUFPNT2_F7BP3_MASK                    0x00008000
#define _C1BUFPNT2_F7BP3_LENGTH                  0x00000001

#define _C1RXFUL2_RXFUL16_POSITION               0x00000000
#define _C1RXFUL2_RXFUL16_MASK                   0x00000001
#define _C1RXFUL2_RXFUL16_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL17_POSITION               0x00000001
#define _C1RXFUL2_RXFUL17_MASK                   0x00000002
#define _C1RXFUL2_RXFUL17_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL18_POSITION               0x00000002
#define _C1RXFUL2_RXFUL18_MASK                   0x00000004
#define _C1RXFUL2_RXFUL18_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL19_POSITION               0x00000003
#define _C1RXFUL2_RXFUL19_MASK                   0x00000008
#define _C1RXFUL2_RXFUL19_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL20_POSITION               0x00000004
#define _C1RXFUL2_RXFUL20_MASK                   0x00000010
#define _C1RXFUL2_RXFUL20_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL21_POSITION               0x00000005
#define _C1RXFUL2_RXFUL21_MASK                   0x00000020
#define _C1RXFUL2_RXFUL21_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL22_POSITION               0x00000006
#define _C1RXFUL2_RXFUL22_MASK                   0x00000040
#define _C1RXFUL2_RXFUL22_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL23_POSITION               0x00000007
#define _C1RXFUL2_RXFUL23_MASK                   0x00000080
#define _C1RXFUL2_RXFUL23_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL24_POSITION               0x00000008
#define _C1RXFUL2_RXFUL24_MASK                   0x00000100
#define _C1RXFUL2_RXFUL24_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL25_POSITION               0x00000009
#define _C1RXFUL2_RXFUL25_MASK                   0x00000200
#define _C1RXFUL2_RXFUL25_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL26_POSITION               0x0000000A
#define _C1RXFUL2_RXFUL26_MASK                   0x00000400
#define _C1RXFUL2_RXFUL26_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL27_POSITION               0x0000000B
#define _C1RXFUL2_RXFUL27_MASK                   0x00000800
#define _C1RXFUL2_RXFUL27_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL28_POSITION               0x0000000C
#define _C1RXFUL2_RXFUL28_MASK                   0x00001000
#define _C1RXFUL2_RXFUL28_LENGTH                 0x00000001

